// 제로베이스 프론트엔드 스쿨_Lucky
/*
[문제 설명]

제로는 행운의 숫자를 굉장히 좋아합니다. 행운의 숫자를 판단하는 제로만의 룰이 있는데, 이 룰은 다음과 같습니다.

1. 숫자를 절반으로 잘랐을 때 잘린 두 부분의 합이 같아야 한다.

2. 숫자는 1과 7로만 이루어져 있어야 한다.

이 때, 주어진 여러 숫자를 보고 이 숫자가 행운의 숫자인지 판단하여 제로가 이 함수를 사용할 수 있도록 해주세요.

행운의 숫자라면 1으로, 행운의 숫자가 아니라면 0으로 판단하여 배열을 반환해주시면 됩니다.

만약 [1771, 7777, 4321, 1717]이 주어졌을 때는, [1, 1, 0, 0]으로 반환해주시면 됩니다.

[제한 사항]

- 숫자 lucky 배열의 길이는 1 이상 50 이하입니다.

- 숫자 lucky 배열의 원소는 항상 짝수길이로 존재합니다. e.g., 2자리 정수, 4자리 정수, 6자리 정수 등

[입력 형식]

- 숫자배열 lucky가 입력으로 주어집니다.

[출력 형식]

- 각 숫자를 행운의 숫자인지 판단하여 배열으로 반환해주세요.
*/

function solution(lucky) {
  let answer = [];

  return answer;
}

console.log(solution([777777, 111111])); // output: [1, 1]
